In [0]:
import pandas as pd

In [3]:
arquivo = '../content/drive/My Drive/Temp/salarios2.csv'
df = pd.read_csv(arquivo)
df.head()

             Full Name            Position Title  ... Monthly Salary  Daily Salary
0      AARON,  ELVIA J          WATER RATE TAKER  ...        7413.75        243.74
1    AARON,  JEFFERY M            POLICE OFFICER  ...        6731.50        221.31
2       AARON,  KARINA            POLICE OFFICER  ...        6731.50        221.31
3  AARON,  KIMBERLEI R  CHIEF CONTRACT EXPEDITER  ...        7065.00        232.27
4  ABAD JR,  VICENTE M         CIVIL ENGINEER IV  ...        8728.00        286.95

[5 rows x 6 columns]

---
### **Removendo duplicatas**

In [4]:
df[df['Full Name']=='RIVERA,  RICARDO']

              Full Name          Position Title  ... Monthly Salary  Daily Salary
24212  RIVERA,  RICARDO  MACHINIST (AUTOMOTIVE)  ...        7687.33        252.73
24213  RIVERA,  RICARDO                SERGEANT  ...        8910.00        292.93
24214  RIVERA,  RICARDO          POLICE OFFICER  ...        7476.50        245.80
24215  RIVERA,  RICARDO          POLICE OFFICER  ...        6968.00        229.08

[4 rows x 6 columns]

In [5]:
df_nodup = df.drop_duplicates(subset='Full Name')
df_nodup[df_nodup['Full Name']=='RIVERA,  RICARDO']

              Full Name          Position Title  ... Monthly Salary  Daily Salary
24212  RIVERA,  RICARDO  MACHINIST (AUTOMOTIVE)  ...        7687.33        252.73

[1 rows x 6 columns]